postman_step2/postman/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "買い物に行く"], ["created_at", "2024-01-23 11:54:27.927527"], ["updated_at", "2024-01-23 11:54:27.927527"]]
---
  def index


    @todos = Todo.all
  todos_array = [] # TODOの情報を格納するための空の配列

  @todos.each do |todo|
    todos_array << {

INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "いろんなところに行く"], ["created_at", "2024-01-25 13:43:02.099180"], ["updated_at", "2024-01-25 13:43:02.099180"]]
---
  def create
    @todo = Todo.new(todo_params)


  if @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "色々"], ["updated_at", "2024-01-25 14:00:48.699501"], ["id", 1]]
---
  def update

    @todo = Todo.find(params[:id])

  if @todo.update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 2]]
---
  def destroy
    @id = Todo.find(params[:id])
    if @id.destroy